###################################################################

# Created by write_sdc on Wed Dec 20 01:09:01 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode top
set_wire_load_model -name Small -library                                       \
sc9_cln40g_base_rvt_tt_typical_max_0p90v_25c
set_load -pin_load 0.05 [get_ports out_valid]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[20]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[19]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[18]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[17]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[16]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[15]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[14]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[13]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[12]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[11]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[10]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[9]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[8]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[7]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[6]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[5]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[4]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[3]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[2]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[1]}]
set_load -pin_load 0.05 [get_ports {Shift_and_Add[0]}]
set_ideal_network -no_propagate  [get_ports clk]
create_clock [get_ports clk]  -period 26.5625  -waveform {0 13.2812}
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  13.2812  [get_ports in_valid]
set_input_delay -clock clk  13.2812  [get_ports {ADC_RESULT[5]}]
set_input_delay -clock clk  13.2812  [get_ports {ADC_RESULT[4]}]
set_input_delay -clock clk  13.2812  [get_ports {ADC_RESULT[3]}]
set_input_delay -clock clk  13.2812  [get_ports {ADC_RESULT[2]}]
set_input_delay -clock clk  13.2812  [get_ports {ADC_RESULT[1]}]
set_input_delay -clock clk  13.2812  [get_ports {ADC_RESULT[0]}]
set_input_delay -clock clk  13.2812  [get_ports {WEIGHT_BIT_POSITION[7]}]
set_input_delay -clock clk  13.2812  [get_ports {WEIGHT_BIT_POSITION[6]}]
set_input_delay -clock clk  13.2812  [get_ports {WEIGHT_BIT_POSITION[5]}]
set_input_delay -clock clk  13.2812  [get_ports {WEIGHT_BIT_POSITION[4]}]
set_input_delay -clock clk  13.2812  [get_ports {WEIGHT_BIT_POSITION[3]}]
set_input_delay -clock clk  13.2812  [get_ports {WEIGHT_BIT_POSITION[2]}]
set_input_delay -clock clk  13.2812  [get_ports {WEIGHT_BIT_POSITION[1]}]
set_input_delay -clock clk  13.2812  [get_ports {WEIGHT_BIT_POSITION[0]}]
set_input_delay -clock clk  13.2812  [get_ports {ONES_COUNTER[4]}]
set_input_delay -clock clk  13.2812  [get_ports {ONES_COUNTER[3]}]
set_input_delay -clock clk  13.2812  [get_ports {ONES_COUNTER[2]}]
set_input_delay -clock clk  13.2812  [get_ports {ONES_COUNTER[1]}]
set_input_delay -clock clk  13.2812  [get_ports {ONES_COUNTER[0]}]
set_input_delay -clock clk  13.2812  [get_ports {INPUT_BIT_POSITION[2]}]
set_input_delay -clock clk  13.2812  [get_ports {INPUT_BIT_POSITION[1]}]
set_input_delay -clock clk  13.2812  [get_ports {INPUT_BIT_POSITION[0]}]
set_output_delay -clock clk  13.2812  [get_ports out_valid]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[20]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[19]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[18]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[17]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[16]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[15]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[14]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[13]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[12]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[11]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[10]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[9]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[8]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[7]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[6]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[5]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[4]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[3]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[2]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[1]}]
set_output_delay -clock clk  13.2812  [get_ports {Shift_and_Add[0]}]
