###################################################################

# Created by write_sdc on Wed Jan 31 18:19:45 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode top
set_wire_load_model -name Small -library                                       \
sc9_cln40g_base_rvt_tt_typical_max_0p90v_25c
set_load -pin_load 0.05 [get_ports out_valid]
set_load -pin_load 0.05 [get_ports {demux[63]}]
set_load -pin_load 0.05 [get_ports {demux[62]}]
set_load -pin_load 0.05 [get_ports {demux[61]}]
set_load -pin_load 0.05 [get_ports {demux[60]}]
set_load -pin_load 0.05 [get_ports {demux[59]}]
set_load -pin_load 0.05 [get_ports {demux[58]}]
set_load -pin_load 0.05 [get_ports {demux[57]}]
set_load -pin_load 0.05 [get_ports {demux[56]}]
set_load -pin_load 0.05 [get_ports {demux[55]}]
set_load -pin_load 0.05 [get_ports {demux[54]}]
set_load -pin_load 0.05 [get_ports {demux[53]}]
set_load -pin_load 0.05 [get_ports {demux[52]}]
set_load -pin_load 0.05 [get_ports {demux[51]}]
set_load -pin_load 0.05 [get_ports {demux[50]}]
set_load -pin_load 0.05 [get_ports {demux[49]}]
set_load -pin_load 0.05 [get_ports {demux[48]}]
set_load -pin_load 0.05 [get_ports {demux[47]}]
set_load -pin_load 0.05 [get_ports {demux[46]}]
set_load -pin_load 0.05 [get_ports {demux[45]}]
set_load -pin_load 0.05 [get_ports {demux[44]}]
set_load -pin_load 0.05 [get_ports {demux[43]}]
set_load -pin_load 0.05 [get_ports {demux[42]}]
set_load -pin_load 0.05 [get_ports {demux[41]}]
set_load -pin_load 0.05 [get_ports {demux[40]}]
set_load -pin_load 0.05 [get_ports {demux[39]}]
set_load -pin_load 0.05 [get_ports {demux[38]}]
set_load -pin_load 0.05 [get_ports {demux[37]}]
set_load -pin_load 0.05 [get_ports {demux[36]}]
set_load -pin_load 0.05 [get_ports {demux[35]}]
set_load -pin_load 0.05 [get_ports {demux[34]}]
set_load -pin_load 0.05 [get_ports {demux[33]}]
set_load -pin_load 0.05 [get_ports {demux[32]}]
set_load -pin_load 0.05 [get_ports {demux[31]}]
set_load -pin_load 0.05 [get_ports {demux[30]}]
set_load -pin_load 0.05 [get_ports {demux[29]}]
set_load -pin_load 0.05 [get_ports {demux[28]}]
set_load -pin_load 0.05 [get_ports {demux[27]}]
set_load -pin_load 0.05 [get_ports {demux[26]}]
set_load -pin_load 0.05 [get_ports {demux[25]}]
set_load -pin_load 0.05 [get_ports {demux[24]}]
set_load -pin_load 0.05 [get_ports {demux[23]}]
set_load -pin_load 0.05 [get_ports {demux[22]}]
set_load -pin_load 0.05 [get_ports {demux[21]}]
set_load -pin_load 0.05 [get_ports {demux[20]}]
set_load -pin_load 0.05 [get_ports {demux[19]}]
set_load -pin_load 0.05 [get_ports {demux[18]}]
set_load -pin_load 0.05 [get_ports {demux[17]}]
set_load -pin_load 0.05 [get_ports {demux[16]}]
set_load -pin_load 0.05 [get_ports {demux[15]}]
set_load -pin_load 0.05 [get_ports {demux[14]}]
set_load -pin_load 0.05 [get_ports {demux[13]}]
set_load -pin_load 0.05 [get_ports {demux[12]}]
set_load -pin_load 0.05 [get_ports {demux[11]}]
set_load -pin_load 0.05 [get_ports {demux[10]}]
set_load -pin_load 0.05 [get_ports {demux[9]}]
set_load -pin_load 0.05 [get_ports {demux[8]}]
set_load -pin_load 0.05 [get_ports {demux[7]}]
set_load -pin_load 0.05 [get_ports {demux[6]}]
set_load -pin_load 0.05 [get_ports {demux[5]}]
set_load -pin_load 0.05 [get_ports {demux[4]}]
set_load -pin_load 0.05 [get_ports {demux[3]}]
set_load -pin_load 0.05 [get_ports {demux[2]}]
set_load -pin_load 0.05 [get_ports {demux[1]}]
set_load -pin_load 0.05 [get_ports {demux[0]}]
set_ideal_network -no_propagate  [get_ports clk]
create_clock [get_ports clk]  -period 0.78125  -waveform {0 0.390625}
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  0.390625  [get_ports in_valid]
set_input_delay -clock clk  0.390625  [get_ports {WHICH_FILTER[5]}]
set_input_delay -clock clk  0.390625  [get_ports {WHICH_FILTER[4]}]
set_input_delay -clock clk  0.390625  [get_ports {WHICH_FILTER[3]}]
set_input_delay -clock clk  0.390625  [get_ports {WHICH_FILTER[2]}]
set_input_delay -clock clk  0.390625  [get_ports {WHICH_FILTER[1]}]
set_input_delay -clock clk  0.390625  [get_ports {WHICH_FILTER[0]}]
set_output_delay -clock clk  0.390625  [get_ports out_valid]
set_output_delay -clock clk  0.390625  [get_ports {demux[63]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[62]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[61]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[60]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[59]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[58]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[57]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[56]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[55]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[54]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[53]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[52]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[51]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[50]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[49]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[48]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[47]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[46]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[45]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[44]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[43]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[42]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[41]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[40]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[39]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[38]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[37]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[36]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[35]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[34]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[33]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[32]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[31]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[30]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[29]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[28]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[27]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[26]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[25]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[24]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[23]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[22]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[21]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[20]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[19]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[18]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[17]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[16]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[15]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[14]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[13]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[12]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[11]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[10]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[9]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[8]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[7]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[6]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[5]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[4]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[3]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[2]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[1]}]
set_output_delay -clock clk  0.390625  [get_ports {demux[0]}]
