###################################################################

# Created by write_sdc on Mon Jan 15 15:11:14 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode top
set_wire_load_model -name Small -library                                       \
sc9_cln40g_base_rvt_tt_typical_max_0p90v_25c
set_load -pin_load 0.05 [get_ports {out[27]}]
set_load -pin_load 0.05 [get_ports {out[26]}]
set_load -pin_load 0.05 [get_ports {out[25]}]
set_load -pin_load 0.05 [get_ports {out[24]}]
set_load -pin_load 0.05 [get_ports {out[23]}]
set_load -pin_load 0.05 [get_ports {out[22]}]
set_load -pin_load 0.05 [get_ports {out[21]}]
set_load -pin_load 0.05 [get_ports {out[20]}]
set_load -pin_load 0.05 [get_ports {out[19]}]
set_load -pin_load 0.05 [get_ports {out[18]}]
set_load -pin_load 0.05 [get_ports {out[17]}]
set_load -pin_load 0.05 [get_ports {out[16]}]
set_load -pin_load 0.05 [get_ports {out[15]}]
set_load -pin_load 0.05 [get_ports {out[14]}]
set_load -pin_load 0.05 [get_ports {out[13]}]
set_load -pin_load 0.05 [get_ports {out[12]}]
set_load -pin_load 0.05 [get_ports {out[11]}]
set_load -pin_load 0.05 [get_ports {out[10]}]
set_load -pin_load 0.05 [get_ports {out[9]}]
set_load -pin_load 0.05 [get_ports {out[8]}]
set_load -pin_load 0.05 [get_ports {out[7]}]
set_load -pin_load 0.05 [get_ports {out[6]}]
set_load -pin_load 0.05 [get_ports {out[5]}]
set_load -pin_load 0.05 [get_ports {out[4]}]
set_load -pin_load 0.05 [get_ports {out[3]}]
set_load -pin_load 0.05 [get_ports {out[2]}]
set_load -pin_load 0.05 [get_ports {out[1]}]
set_load -pin_load 0.05 [get_ports {out[0]}]
set_ideal_network -no_propagate  [get_ports clk]
create_clock [get_ports clk]  -period 26.5625  -waveform {0 13.2812}
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  0  [get_ports {in[41]}]
set_input_delay -clock clk  0  [get_ports {in[40]}]
set_input_delay -clock clk  0  [get_ports {in[39]}]
set_input_delay -clock clk  0  [get_ports {in[38]}]
set_input_delay -clock clk  0  [get_ports {in[37]}]
set_input_delay -clock clk  0  [get_ports {in[36]}]
set_input_delay -clock clk  0  [get_ports {in[35]}]
set_input_delay -clock clk  0  [get_ports {in[34]}]
set_input_delay -clock clk  0  [get_ports {in[33]}]
set_input_delay -clock clk  0  [get_ports {in[32]}]
set_input_delay -clock clk  0  [get_ports {in[31]}]
set_input_delay -clock clk  0  [get_ports {in[30]}]
set_input_delay -clock clk  0  [get_ports {in[29]}]
set_input_delay -clock clk  0  [get_ports {in[28]}]
set_input_delay -clock clk  0  [get_ports {in[27]}]
set_input_delay -clock clk  0  [get_ports {in[26]}]
set_input_delay -clock clk  0  [get_ports {in[25]}]
set_input_delay -clock clk  0  [get_ports {in[24]}]
set_input_delay -clock clk  0  [get_ports {in[23]}]
set_input_delay -clock clk  0  [get_ports {in[22]}]
set_input_delay -clock clk  0  [get_ports {in[21]}]
set_input_delay -clock clk  0  [get_ports {in[20]}]
set_input_delay -clock clk  0  [get_ports {in[19]}]
set_input_delay -clock clk  0  [get_ports {in[18]}]
set_input_delay -clock clk  0  [get_ports {in[17]}]
set_input_delay -clock clk  0  [get_ports {in[16]}]
set_input_delay -clock clk  0  [get_ports {in[15]}]
set_input_delay -clock clk  0  [get_ports {in[14]}]
set_input_delay -clock clk  0  [get_ports {in[13]}]
set_input_delay -clock clk  0  [get_ports {in[12]}]
set_input_delay -clock clk  0  [get_ports {in[11]}]
set_input_delay -clock clk  0  [get_ports {in[10]}]
set_input_delay -clock clk  0  [get_ports {in[9]}]
set_input_delay -clock clk  0  [get_ports {in[8]}]
set_input_delay -clock clk  0  [get_ports {in[7]}]
set_input_delay -clock clk  0  [get_ports {in[6]}]
set_input_delay -clock clk  0  [get_ports {in[5]}]
set_input_delay -clock clk  0  [get_ports {in[4]}]
set_input_delay -clock clk  0  [get_ports {in[3]}]
set_input_delay -clock clk  0  [get_ports {in[2]}]
set_input_delay -clock clk  0  [get_ports {in[1]}]
set_input_delay -clock clk  0  [get_ports {in[0]}]
set_output_delay -clock clk  0  [get_ports {out[27]}]
set_output_delay -clock clk  0  [get_ports {out[26]}]
set_output_delay -clock clk  0  [get_ports {out[25]}]
set_output_delay -clock clk  0  [get_ports {out[24]}]
set_output_delay -clock clk  0  [get_ports {out[23]}]
set_output_delay -clock clk  0  [get_ports {out[22]}]
set_output_delay -clock clk  0  [get_ports {out[21]}]
set_output_delay -clock clk  0  [get_ports {out[20]}]
set_output_delay -clock clk  0  [get_ports {out[19]}]
set_output_delay -clock clk  0  [get_ports {out[18]}]
set_output_delay -clock clk  0  [get_ports {out[17]}]
set_output_delay -clock clk  0  [get_ports {out[16]}]
set_output_delay -clock clk  0  [get_ports {out[15]}]
set_output_delay -clock clk  0  [get_ports {out[14]}]
set_output_delay -clock clk  0  [get_ports {out[13]}]
set_output_delay -clock clk  0  [get_ports {out[12]}]
set_output_delay -clock clk  0  [get_ports {out[11]}]
set_output_delay -clock clk  0  [get_ports {out[10]}]
set_output_delay -clock clk  0  [get_ports {out[9]}]
set_output_delay -clock clk  0  [get_ports {out[8]}]
set_output_delay -clock clk  0  [get_ports {out[7]}]
set_output_delay -clock clk  0  [get_ports {out[6]}]
set_output_delay -clock clk  0  [get_ports {out[5]}]
set_output_delay -clock clk  0  [get_ports {out[4]}]
set_output_delay -clock clk  0  [get_ports {out[3]}]
set_output_delay -clock clk  0  [get_ports {out[2]}]
set_output_delay -clock clk  0  [get_ports {out[1]}]
set_output_delay -clock clk  0  [get_ports {out[0]}]
